tutorials/nineBlocks-vars/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// variable definition
x0 0; x1 1; x2 2; x3 3;
y0 0; y1 1; y2 2; y3 3;
zMin 0; zMax 3;

nx0 7; nx1 5; nx2 3;
ny0 7; ny1 5; ny2 3;
nz 10;

// blockMesh settings
scale   1;

vertices
(
    // B0 zMin surface
    ($x0 $y0 $zMin)  // v00
    ($x1 $y0 $zMin)  // v01
    ($x1 $y1 $zMin)  // v02
    ($x0 $y1 $zMin)  // v03

    // B1 zMin surface
    //($x1 $y0 $zMin)  // v01
    ($x2 $y0 $zMin)  // v04
    ($x2 $y1 $zMin)  // v05
    //($x1 $y1 $zMin)  // v02

    // B2 zMin surface
    //($x2 $y0 $zMin)  // v04
    ($x3 $y0 $zMin)  // v06
    ($x3 $y1 $zMin)  // v07
    //($x2 $y1 $zMin)  // v05

    // B3 zMin surface
    //($x0 $y1 $zMin)  // v03
    //($x1 $y1 $zMin)  // v02
    ($x1 $y2 $zMin)  // v08
    ($x0 $y2 $zMin)  // v09

    // B4 zMin surface
    //($x1 $y1 $zMin)  // v02
    //($x2 $y1 $zMin)  // v05
    ($x2 $y2 $zMin)  // v10
    //($x1 $y2 $zMin)  // v08

    // B5 zMin surface
    //($x2 $y1 $zMin)  // v05
    //($x3 $y1 $zMin)  // v07
    ($x3 $y2 $zMin)  // v11
    //($x2 $y2 $zMin)  // v10

    // B6 zMin surface
    //($x0 $y2 $zMin)  // v09
    //($x1 $y2 $zMin)  // v08
    ($x1 $y3 $zMin)  // v12
    ($x0 $y3 $zMin)  // v13

    // B7 zMin surface
    //($x1 $y2 $zMin)  // v08
    //($x2 $y2 $zMin)  // v10
    ($x2 $y3 $zMin)  // v14
    //($x1 $y3 $zMin)  // v12

    // B8 zMin surface
    //($x2 $y2 $zMin)  // v10
    //($x3 $y2 $zMin)  // v11
    ($x3 $y3 $zMin)  // v15
    //($x2 $y3 $zMin)  // v14


    // B0 zMax surface
    ($x0 $y0 $zMax)  // v16
    ($x1 $y0 $zMax)  // v17
    ($x1 $y1 $zMax)  // v18
    ($x0 $y1 $zMax)  // v19

    // B1 zMax surface
    //($x1 $y0 $zMax)  // v17
    ($x2 $y0 $zMax)  // v20
    ($x2 $y1 $zMax)  // v21
    //($x1 $y1 $zMax)  // v18

    // B2 zMax surface
    //($x2 $y0 $zMax)  // v20
    ($x3 $y0 $zMax)  // v22
    ($x3 $y1 $zMax)  // v23
    //($x2 $y1 $zMax)  // v21

    // B3 zMax surface
    //($x0 $y1 $zMax)  // v19
    //($x1 $y1 $zMax)  // v18
    ($x1 $y2 $zMax)  // v24
    ($x0 $y2 $zMax)  // v25

    // B4 zMax surface
    //($x1 $y1 $zMax)  // v18
    //($x2 $y1 $zMax)  // v21
    ($x2 $y2 $zMax)  // v26
    //($x1 $y2 $zMax)  // v24

    // B5 zMax surface
    //($x2 $y1 $zMax)  // v21
    //($x3 $y1 $zMax)  // v23
    ($x3 $y2 $zMax)  // v27
    //($x2 $y2 $zMax)  // v26

    // B6 zMax surface
    //($x0 $y2 $zMax)  // v25
    //($x1 $y2 $zMax)  // v24
    ($x1 $y3 $zMax)  // v28
    ($x0 $y3 $zMax)  // v29

    // B7 zMax surface
    //($x1 $y2 $zMax)  // v24
    //($x2 $y2 $zMax)  // v26
    ($x2 $y3 $zMax)  // v30
    //($x1 $y3 $zMax)  // v28

    // B8 zMax surface
    //($x2 $y2 $zMax)  // v26
    //($x3 $y2 $zMax)  // v27
    ($x3 $y3 $zMax)  // v31
    //($x2 $y3 $zMax)  // v30
);

blocks
(
    // zMax number = zMin + 16
    hex ( 0  1  2  3 16 17 18 19) ($nx0 $ny0 $nz) grading (1 1 1) // B0
    hex ( 1  4  5  2 17 20 21 18) ($nx1 $ny0 $nz) grading (1 1 1) // B1
    hex ( 4  6  7  5 20 22 23 21) ($nx2 $ny0 $nz) grading (1 1 1) // B2

    hex ( 3  2  8  9 19 18 24 25) ($nx0 $ny1 $nz) grading (1 1 1) // B3
    hex ( 2  5 10  8 18 21 26 24) ($nx1 $ny1 $nz) grading (1 1 1) // B4
    hex ( 5  7 11 10 21 23 27 26) ($nx2 $ny1 $nz) grading (1 1 1) // B5

    hex ( 9  8 12 13 25 24 28 29) ($nx0 $ny2 $nz) grading (1 1 1) // B6
    hex ( 8 10 14 12 24 26 30 28) ($nx1 $ny2 $nz) grading (1 1 1) // B7
    hex (10 11 15 14 26 27 31 30) ($nx2 $ny2 $nz) grading (1 1 1) // B8
);

edges ( );

boundary
(
    xMin
    {
        type patch;
        faces
        (
            (0 0)
            (3 0)
            (6 0)
        );
    }
    xMax
    {
        type patch;
        faces
        (
            (2 1)
            (5 1)
            (8 1)
        );
    }
    yMin
    {
        type patch;
        faces
        (
            (0 2)
            (1 2)
            (2 2)
        );
    }
    yMax
    {
        type patch;
        faces
        (
            (6 3)
            (7 3)
            (8 3)
        );
    }
    zMin
    {
        type patch;
        faces
        (
            (0 4)
            (1 4)
            (2 4)
            (3 4)
            (4 4)
            (5 4)
            (6 4)
            (7 4)
            (8 4)
        );
    }
    zMax
    {
        type patch;
        faces
        (
            (0 5)
            (1 5)
            (2 5)
            (3 5)
            (4 5)
            (5 5)
            (6 5)
            (7 5)
            (8 5)
        );
    }
);

// ************************************************************************* //
